Documents/СообщениеДилеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СообщениеДилеру</Name>
			<Comment>Документ для рассылки сообщений от супервайзера дилеру</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОзнакомленСообщенияДилеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ОзнакомленСообщенияДилеру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ознакомлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеДилеру</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СообщениеДилеру/Forms/ФормаПросмотра/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбАвтор = Объект.Автор;
	
	Если ОбАвтор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда	
		ОбАвтор=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОзнакомлен()
	
	Озн=Ложь;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сообщение", Объект.Ссылка);
	Запрос.УстановитьПараметр("Дилер", ПользователиКлиентСервер.ТекущийВнешнийПользователь());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОзнакомленСообщенияДилеру.Ознакомлен
	|ИЗ
	|	РегистрСведений.ОзнакомленСообщенияДилеру КАК ОзнакомленСообщенияДилеру
	|ГДЕ
	|	ОзнакомленСообщенияДилеру.Сообщение = &Сообщение
	|	И ОзнакомленСообщенияДилеру.Дилер = &Дилер";
	
	ВыборкаОзнакомлен = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаОзнакомлен.Количество()>0 Тогда
		Озн=Истина;
	КонецЕсли; 
	
	Возврат Озн;

КонецФункции

&НаСервере
Процедура ЗаписатьОзнакомлен()

	НоваяЗапись = РегистрыСведений.ОзнакомленСообщенияДилеру.СоздатьМенеджерЗаписи();
	НоваяЗапись.Сообщение = Объект.Ссылка;
	НоваяЗапись.Дилер = ПользователиКлиентСервер.ТекущийВнешнийПользователь();
	НоваяЗапись.Ознакомлен = Истина;
	НоваяЗапись.Записать();

КонецПроцедуры
 

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ознакомлен=ПолучитьОзнакомлен();
	Если Ознакомлен=Истина Тогда
		Элементы.Ознакомлен.Доступность=Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Элементы.Ознакомлен.Доступность=Истина И Ознакомлен=Истина Тогда
		ЗаписатьОзнакомлен();
		Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
			Оповестить("ОбновитьСписок",Объект.Ссылка);
			//ЭтаФорма.ВладелецФормы.УдалитьЭлемент(Объект.Ссылка);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
